
print(2**16)

with open('taha.txt',"r",encoding='utf_8') as file:
#     file.write("""سلام

# درود بر شما

# این پستم با دو تا پست قبلم فرق داره. (اگه نخوندیدشون حتما بخونید تا از یه خطر خیلی بزرگ بتونید رهایی پیدا کنید. )

# خب اما این پست در باره ی چی هست؟!

# بعله! همین طوری که از عنوانش هم معلومه قواعد شرطی پایتون.

# خب بی مقدمه بریم برای شروع

# IF = اگر

# خیلی ساده است.

# اگر بخوایم جایی به پایتون بگیم مثلا اگر متغیر a برابر با هست یا نه این کار رو برامون بکن، باید این طوری بنویسیم.

# اول ایف. جلوی ایف شرط یا کاندیشن رو می نویسیم. جلوی اون هم یه دو نقطه می زاریم. بعد می ریم خط بعد. با یه فاصله ی کوچیک (معمولا توی محیط های توسعه ی کد خودشون بعد ایف می زارن این فاصله رو) دستوری که می خوایم اجرا شه رو می زاریم.

### مثلا توی این نمونه الان می خوایم بگیم که اگه عدد برابر با دو هست برای ما پرینت کنه که عدد برابر با دو ئه.""")///
    print(file.readlines())